In [66]:
import pandas

# https://pandas.pydata.org/docs/getting_started/intro_tutorials/01_table_oriented.html

# from pandas import DataFrame
# from pandas import *
# from math import abs, log10, log

In [67]:
# pandas.read_csv(pathname)
# pandas.read_excel(pathname)
dataframe = pandas.read_csv('/Users/israel/COURS-PYTHON-3/Day9/databases/data-2.csv')

In [68]:
import pandas as pd

In [69]:
# pandas.read_csv(pathname)
# pandas.read_excel(pathname)
dataframe = pd.read_csv('/Users/israel/COURS-PYTHON-3/Day9/databases/data-2.csv')

In [70]:
# Afficher le type d'une variable
type(dataframe)

pandas.core.frame.DataFrame

In [71]:
# DataFrame combinaison ( line + columns )
# pandas, numpy, matplotlib, skitlearn
# Afiicher les cinqs premières lignes
dataframe.head()

,name,email,address,country,region,currency
0,Chadwick Nguyen,nec.ligula@protonmail.edu,Ap #466-2636 A Rd.,Germany,Texas,$44.16
1,India Newman,vel.venenatis@icloud.couk,2125 Sed Street,China,Henegouwen,$92.54
2,Deborah Chase,lectus.ante@protonmail.org,Ap #601-6030 Eu Av.,New Zealand,łódzkie,$1.88
3,Donna Salazar,mauris@google.org,781-6803 Curabitur St.,Indonesia,Madrid,$2.68
4,Heidi Bennett,ultrices.a.auctor@hotmail.net,326-6406 Natoque Ave,Norway,South Gyeongsang,$32.80

In [72]:
# DataFrame combinaison ( line + columns )
# pandas, numpy, matplotlib, skitlearn
# Afiicher les cinqs dernières lignes
dataframe.tail()

,name,email,address,country,region,currency
25,Jeanette Duran,orci.sem@icloud.com,9805 Mollis St.,Australia,Magdalena,$75.51
26,Tobias Key,in.faucibus.orci@icloud.couk,"P.O. Box 256, 8876 Sed Ave",Sweden,New South Wales,$0.48
27,George Avila,et.rutrum@protonmail.couk,Ap #284-5000 Orci. Ave,South Korea,Kherson oblast,$25.91
28,Alvin Vaughan,class.aptent.taciti@yahoo.org,384-5221 Quisque Street,Poland,Aisén,$5.55
29,Justin Bright,pede.nec@yahoo.ca,334-4843 Magna. Road,Mexico,Sucre,$17.03

In [73]:
# DataFrame combinaison ( line + columns )
# pandas, numpy, matplotlib, skitlearn
# Afiicher la liste dxes column
dataframe.columns

Index(['name', 'email', 'address', 'country', 'region', 'currency'], dtype='object')

In [74]:
type(dataframe.columns)

pandas.core.indexes.base.Index

In [75]:
# Caster le type Index d'une dataframe
list(dataframe.columns)

['name', 'email', 'address', 'country', 'region', 'currency']

In [76]:
# Afficher la longueur de la liste des columns
len(list(dataframe.columns))

6

In [77]:
# Afficher le contenu de la liste des columns
# Première approche
for column in list(dataframe.columns):
    print(column)

name
email
address
country
region
currency

In [78]:
# Afficher le contenu de la liste des columns
# Utilisation des listes compréhensions
# Deuxième approche
[column for column in list(dataframe.columns)]

['name', 'email', 'address', 'country', 'region', 'currency']

In [79]:
# DataFrame combinaison ( line + columns )
# pandas, numpy, matplotlib, skitlearn
# Afiicher la dimension de la dataframe
dataframe.shape

(30, 6)

In [80]:
# DataFrame combinaison ( line + columns )
# pandas, numpy, matplotlib, skitlearn
# Afficher la dimension de la dataframe
lines, columns = dataframe.shape

print(f'Nombre de ligne: {lines}, nombre de colonne: {columns}')

Nombre de ligne: 30, nombre de colonne: 6

In [81]:
# DataFrame combinaison ( line + columns )
# pandas, numpy, matplotlib, skitlearn
# Afficher plus de 5 lignes
dataframe.head(n=5)

,name,email,address,country,region,currency
0,Chadwick Nguyen,nec.ligula@protonmail.edu,Ap #466-2636 A Rd.,Germany,Texas,$44.16
1,India Newman,vel.venenatis@icloud.couk,2125 Sed Street,China,Henegouwen,$92.54
2,Deborah Chase,lectus.ante@protonmail.org,Ap #601-6030 Eu Av.,New Zealand,łódzkie,$1.88
3,Donna Salazar,mauris@google.org,781-6803 Curabitur St.,Indonesia,Madrid,$2.68
4,Heidi Bennett,ultrices.a.auctor@hotmail.net,326-6406 Natoque Ave,Norway,South Gyeongsang,$32.80

In [82]:
# DataFrame combinaison ( line + columns )
# pandas, numpy, matplotlib, skitlearn
# Afficher plus de 5 lignes
dataframe.head(n=10)

,name,email,address,country,region,currency
0,Chadwick Nguyen,nec.ligula@protonmail.edu,Ap #466-2636 A Rd.,Germany,Texas,$44.16
1,India Newman,vel.venenatis@icloud.couk,2125 Sed Street,China,Henegouwen,$92.54
2,Deborah Chase,lectus.ante@protonmail.org,Ap #601-6030 Eu Av.,New Zealand,łódzkie,$1.88
3,Donna Salazar,mauris@google.org,781-6803 Curabitur St.,Indonesia,Madrid,$2.68
4,Heidi Bennett,ultrices.a.auctor@hotmail.net,326-6406 Natoque Ave,Norway,South Gyeongsang,$32.80
5,Hyacinth Bauer,urna.suscipit@protonmail.com,"601-916 Ante, Rd.",Russian Federation,Cusco,$28.43
6,Forrest Sweeney,commodo.ipsum@aol.edu,5500 Ut Avenue,Canada,Novgorod Oblast,$47.63
7,Kirestin Kramer,aliquet.molestie.tellus@aol.edu,"1495 Id, Rd.",Poland,Namen,$82.24
8,Grant George,felis@google.org,508-5183 Suspendisse Avenue,Australia,Comunitat Valenciana,$38.37
9,Shaeleigh Le,quisque@hotmail.couk,Ap #600-3443 Dictum. St.,Ireland,Västra Götalands län,$23.51

In [83]:
# DataFrame combinaison ( line + columns )
# pandas, numpy, matplotlib, skitlearn
# Afficher plus de 5 dernières lignes
dataframe.tail(n=10)

,name,email,address,country,region,currency
20,Nash Herring,quisque@outlook.edu,991-5819 Ante Rd.,Chile,South Australia,$26.40
21,Ingrid Doyle,phasellus.at@outlook.couk,192 Magna. Avenue,Russian Federation,Poitou-Charentes,$2.89
22,Kim Brock,non.dapibus@aol.ca,654-8001 Semper Ave,Indonesia,Cagayan Valley,$22.15
23,Harlan Baker,sit@protonmail.org,"6090 Vulputate, St.",France,Antwerpen,$2.17
24,Lester Olsen,dolor.quam.elementum@icloud.net,968-2002 Sed Ave,Ireland,Comunitat Valenciana,$95.04
25,Jeanette Duran,orci.sem@icloud.com,9805 Mollis St.,Australia,Magdalena,$75.51
26,Tobias Key,in.faucibus.orci@icloud.couk,"P.O. Box 256, 8876 Sed Ave",Sweden,New South Wales,$0.48
27,George Avila,et.rutrum@protonmail.couk,Ap #284-5000 Orci. Ave,South Korea,Kherson oblast,$25.91
28,Alvin Vaughan,class.aptent.taciti@yahoo.org,384-5221 Quisque Street,Poland,Aisén,$5.55
29,Justin Bright,pede.nec@yahoo.ca,334-4843 Magna. Road,Mexico,Sucre,$17.03

In [84]:
# DataFrame combinaison ( line + columns )
# pandas, numpy, matplotlib, skitlearn
# Afficher une colonne address
dataframe['address']

0               Ap #466-2636 A Rd.
1                  2125 Sed Street
2              Ap #601-6030 Eu Av.
3           781-6803 Curabitur St.
4             326-6406 Natoque Ave
5                601-916 Ante, Rd.
6                   5500 Ut Avenue
7                     1495 Id, Rd.
8      508-5183 Suspendisse Avenue
9         Ap #600-3443 Dictum. St.
10            824-2407 Nisi Street
11    P.O. Box 502, 7825 A, Avenue
12    P.O. Box 764, 2041 Etiam St.
13                     126 Sit Rd.
14           Ap #932-2288 Nunc Rd.
15              369-9250 Et Street
16                134-4184 Leo Av.
17          Ap #697-8084 Enim. Rd.
18      P.O. Box 959, 7154 Id, St.
19      P.O. Box 749, 7060 Cum Av.
20               991-5819 Ante Rd.
21               192 Magna. Avenue
22             654-8001 Semper Ave
23             6090 Vulputate, St.
24                968-2002 Sed Ave
25                 9805 Mollis St.
26      P.O. Box 256, 8876 Sed Ave
27          Ap #284-5000 Orci. Ave
28         384-5221 Quisque Street
29            334-4843 Magna. Road
Name: address, dtype: object

In [85]:
# DataFrame combinaison ( line + columns )
# pandas, numpy, matplotlib, skitlearn
# Afficher une colonne country
dataframe['country']

0                Germany
1                  China
2            New Zealand
3              Indonesia
4                 Norway
5     Russian Federation
6                 Canada
7                 Poland
8              Australia
9                Ireland
10                  Peru
11           New Zealand
12                 Italy
13                  Peru
14                 Italy
15               Germany
16                Mexico
17                 Italy
18           Netherlands
19              Pakistan
20                 Chile
21    Russian Federation
22             Indonesia
23                France
24               Ireland
25             Australia
26                Sweden
27           South Korea
28                Poland
29                Mexico
Name: country, dtype: object

In [86]:
# DataFrame combinaison ( line + columns )
# pandas, numpy, matplotlib, skitlearn
# Créer une nouvelle dataframe
address_country = dataframe[['address', 'country']]

In [87]:
address_country.head()

                  address      country
0      Ap #466-2636 A Rd.      Germany
1         2125 Sed Street        China
2     Ap #601-6030 Eu Av.  New Zealand
3  781-6803 Curabitur St.    Indonesia
4    326-6406 Natoque Ave       Norway

In [88]:
type(address_country)

pandas.core.frame.DataFrame

In [89]:
# Convertion en np.array
# Approche des index et le slicing
# Slicing: [0:5] c-a-d fermé sur 0 et ouvert sur 5. 0 à 4
# tab[0], tab[1], tab[2], tab[3], tab[4]
list(dataframe['address'].values)[0:5]

['Ap #466-2636 A Rd.',
 '2125 Sed Street',
 'Ap #601-6030 Eu Av.',
 '781-6803 Curabitur St.',
 '326-6406 Natoque Ave']

In [90]:
type(dataframe['address'].values)

numpy.ndarray

In [91]:
tampon = list(dataframe['address'].values)[0:5]

# Essayer de retirer les # de cet échantillon
type(tampon[0])

str

In [92]:
for index, value in enumerate(tampon):
    tampon[index] = value.replace('#', '')
    
tampon

['Ap 466-2636 A Rd.',
 '2125 Sed Street',
 'Ap 601-6030 Eu Av.',
 '781-6803 Curabitur St.',
 '326-6406 Natoque Ave']

In [93]:
dataframe['address'].head()

0        Ap #466-2636 A Rd.
1           2125 Sed Street
2       Ap #601-6030 Eu Av.
3    781-6803 Curabitur St.
4      326-6406 Natoque Ave
Name: address, dtype: object

In [94]:
def clean_special_character(
    character: str, 
    replace_character: str, 
    dataframe: pd.DataFrame
) -> pd.DataFrame:
    for index, value in enumerate(dataframe):
        if character in value:
            dataframe[index] = value.replace(character, replace_character)
    return dataframe

# Il faut utiliser la fonction copy()
dataframe_tampon_address = dataframe['address']

clean_special_character('#', '', dataframe_tampon_address)[0:5]

0         Ap 466-2636 A Rd.
1           2125 Sed Street
2        Ap 601-6030 Eu Av.
3    781-6803 Curabitur St.
4      326-6406 Natoque Ave
Name: address, dtype: object

In [95]:
dataframe['address'][0:5]

0         Ap 466-2636 A Rd.
1           2125 Sed Street
2        Ap 601-6030 Eu Av.
3    781-6803 Curabitur St.
4      326-6406 Natoque Ave
Name: address, dtype: object

In [96]:
dataframe['address'][0]

'Ap 466-2636 A Rd.'

In [97]:
# Recherche par condition
list(dataframe['address'][0:5])

['Ap 466-2636 A Rd.',
 '2125 Sed Street',
 'Ap 601-6030 Eu Av.',
 '781-6803 Curabitur St.',
 '326-6406 Natoque Ave']

In [98]:
for item in list(dataframe['address'][0:5]):
    if '466-2636' in item:
        print(item)

Ap 466-2636 A Rd.

In [99]:
dataframe.columns[5]

'currency'

In [100]:
# Créer une nouvelle colonne
dataframe['amount'] = 0

In [101]:
dataframe.columns

Index(['name', 'email', 'address', 'country', 'region', 'currency', 'amount'], dtype='object')

In [102]:
dataframe.shape

(30, 7)

In [103]:
dataframe['amount'] = dataframe['currency']

In [104]:
for index, value in enumerate(dataframe['amount']):
    dataframe['amount'][index] = dataframe['amount'][index].replace('$', '')

In [105]:
for index, value in enumerate(dataframe['amount']):
    dataframe['amount'][index] = float(dataframe['amount'][index])

In [106]:
# Suppression de la colonne amount
del dataframe['amount']

In [107]:
dataframe.head()

,name,email,address,country,region,currency
0,Chadwick Nguyen,nec.ligula@protonmail.edu,Ap 466-2636 A Rd.,Germany,Texas,$44.16
1,India Newman,vel.venenatis@icloud.couk,2125 Sed Street,China,Henegouwen,$92.54
2,Deborah Chase,lectus.ante@protonmail.org,Ap 601-6030 Eu Av.,New Zealand,łódzkie,$1.88
3,Donna Salazar,mauris@google.org,781-6803 Curabitur St.,Indonesia,Madrid,$2.68
4,Heidi Bennett,ultrices.a.auctor@hotmail.net,326-6406 Natoque Ave,Norway,South Gyeongsang,$32.80

In [108]:
# Ajouter une colonne sur une dataframe
# Ajouter la colonne amount
# On peut initialiser
# On peut copier une colonne dans une autres
dataframe['amount'] = 1000

In [109]:
dataframe['amount'].head()

0    1000
1    1000
2    1000
3    1000
4    1000
Name: amount, dtype: int64

In [110]:
# Ajouter une colonne sur une dataframe
# Ajouter la colonne amount
# On peut initialiser
# On peut copier une colonne dans une autres
dataframe['amount'] = dataframe['currency']

In [111]:
type(dataframe['amount'][0])

str

In [112]:
# Passage a un type float
for index, value in enumerate(dataframe['amount']):
    dataframe['amount'][index] = float(value.replace('$', ''))

In [113]:
# Manipuluer la colonne avec la fonction apply
# Ajouter 1000 au données de la colonne amount
# apply prend en parametre une fonction ou une lambda expression
dataframe['amount'].apply(lambda x: x+1000)

def increment_thousands(x):
    return x + 1000

In [114]:
dataframe['amount'].apply(increment_thousands)

0     1044.16
1     1092.54
2     1001.88
3     1002.68
4     1032.80
5     1028.43
6     1047.63
7     1082.24
8     1038.37
9     1023.51
10    1074.46
11    1091.20
12    1004.34
13    1078.58
14    1017.44
15    1012.13
16    1063.02
17    1045.48
18    1024.05
19    1018.43
20    1026.40
21    1002.89
22    1022.15
23    1002.17
24    1095.04
25    1075.51
26    1000.48
27    1025.91
28    1005.55
29    1017.03
Name: amount, dtype: float64

In [115]:
# Utilisation de filter
# Faire un filtrage
LIST = [0, 2, 3, 4]

def filtering(x):
    return x % 2 == 0

list(filter(filtering, LIST))

[0, 2, 4]

In [116]:
# Utilisation de map
# Retourne un nouvel iterable
LIST = [0, 2, 3, 4]


def mapping(x):
    return x**2


list(map(mapping, LIST))

[0, 4, 9, 16]

In [117]:
dataframe['amount'] = dataframe['amount'].apply(increment_thousands)

In [118]:
# Faire un filtrage sur la colonne amount
dataframe[dataframe['amount'] > 1050][0:5]

,name,email,address,country,region,currency,amount
1,India Newman,vel.venenatis@icloud.couk,2125 Sed Street,China,Henegouwen,$92.54,1092.54
7,Kirestin Kramer,aliquet.molestie.tellus@aol.edu,"1495 Id, Rd.",Poland,Namen,$82.24,1082.24
10,Scarlett Hester,dui.suspendisse@google.org,824-2407 Nisi Street,Peru,Moscow Oblast,$74.46,1074.46
11,Fritz Meyers,lectus.nullam.suscipit@outlook.edu,"P.O. Box 502, 7825 A, Avenue",New Zealand,Nord-Pas-de-Calais,$91.20,1091.20
13,Hedda Prince,sem@aol.net,126 Sit Rd.,Peru,Møre og Romsdal,$78.58,1078.58

In [119]:
# Afficher la première ligne
dataframe.iloc[0]

name                  Chadwick Nguyen
email       nec.ligula@protonmail.edu
address             Ap 466-2636 A Rd.
country                       Germany
region                          Texas
currency                       $44.16
amount                        1044.16
Name: 0, dtype: object

In [120]:
# Afficher un esnsemble de ligne avec iloc
# Afficher les cinq première lignes
dataframe.iloc[0:5]

,name,email,address,country,region,currency,amount
0,Chadwick Nguyen,nec.ligula@protonmail.edu,Ap 466-2636 A Rd.,Germany,Texas,$44.16,1044.16
1,India Newman,vel.venenatis@icloud.couk,2125 Sed Street,China,Henegouwen,$92.54,1092.54
2,Deborah Chase,lectus.ante@protonmail.org,Ap 601-6030 Eu Av.,New Zealand,łódzkie,$1.88,1001.88
3,Donna Salazar,mauris@google.org,781-6803 Curabitur St.,Indonesia,Madrid,$2.68,1002.68
4,Heidi Bennett,ultrices.a.auctor@hotmail.net,326-6406 Natoque Ave,Norway,South Gyeongsang,$32.80,1032.80

In [121]:
# Iterer sur l'ensemble des lignes avec itterrows()
for index, rows in dataframe.iterrows():
    print(rows)

name                  Chadwick Nguyen
email       nec.ligula@protonmail.edu
address             Ap 466-2636 A Rd.
country                       Germany
region                          Texas
currency                       $44.16
amount                        1044.16
Name: 0, dtype: object
name                     India Newman
email       vel.venenatis@icloud.couk
address               2125 Sed Street
country                         China
region                     Henegouwen
currency                       $92.54
amount                        1092.54
Name: 1, dtype: object
name                     Deborah Chase
email       lectus.ante@protonmail.org
address             Ap 601-6030 Eu Av.
country                    New Zealand
region                         łódzkie
currency                         $1.88
amount                         1001.88
Name: 2, dtype: object
name                 Donna Salazar
email            mauris@google.org
address     781-6803 Curabitur St.
country                  Indonesia
region                      Madrid
currency                     $2.68
amount                     1002.68
Name: 3, dtype: object
name                        Heidi Bennett
email       ultrices.a.auctor@hotmail.net
address              326-6406 Natoque Ave
country                            Norway
region                   South Gyeongsang
currency                           $32.80
amount                             1032.8
Name: 4, dtype: object
name                      Hyacinth Bauer
email       urna.suscipit@protonmail.com
address                601-916 Ante, Rd.
country               Russian Federation
region                             Cusco
currency                          $28.43
amount                           1028.43
Name: 5, dtype: object
name              Forrest Sweeney
email       commodo.ipsum@aol.edu
address            5500 Ut Avenue
country                    Canada
region            Novgorod Oblast
currency                   $47.63
amount                    1047.63
Name: 6, dtype: object
name                        Kirestin Kramer
email       aliquet.molestie.tellus@aol.edu
address                        1495 Id, Rd.
country                              Poland
region                                Namen
currency                             $82.24
amount                              1082.24
Name: 7, dtype: object
name                       Grant George
email                  felis@google.org
address     508-5183 Suspendisse Avenue
country                       Australia
region             Comunitat Valenciana
currency                         $38.37
amount                          1038.37
Name: 8, dtype: object
name                   Shaeleigh Le
email          quisque@hotmail.couk
address     Ap 600-3443 Dictum. St.
country                     Ireland
region         Västra Götalands län
currency                     $23.51
amount                      1023.51
Name: 9, dtype: object
name                   Scarlett Hester
email       dui.suspendisse@google.org
address           824-2407 Nisi Street
country                           Peru
region                   Moscow Oblast
currency                        $74.46
amount                         1074.46
Name: 10, dtype: object
name                              Fritz Meyers
email       lectus.nullam.suscipit@outlook.edu
address           P.O. Box 502, 7825 A, Avenue
country                            New Zealand
region                      Nord-Pas-de-Calais
currency                                $91.20
amount                                  1091.2
Name: 11, dtype: object
name                              Amanda Myers
email       consectetuer.adipiscing@google.net
address           P.O. Box 764, 2041 Etiam St.
country                                  Italy
region                                Rogaland
currency                                 $4.34
amount                                 1004.34
Name: 12, dtype: object
name           Hedda Prince
email           sem@aol.net
address         126 Sit Rd.
country                Peru
region      Møre og Romsdal
currency             $78.58
amount              1078.58
Name: 13, dtype: object
name                 Madonna Garner
email       orci.donec@outlook.couk
address        Ap 932-2288 Nunc Rd.
country                       Italy
region                      Antalya
currency                     $17.44
amount                      1017.44
Name: 14, dtype: object
name                       Tanek Larson
email       a.mi.fringilla@hotmail.couk
address              369-9250 Et Street
country                         Germany
region                  Oost-Vlaanderen
currency                         $12.13
amount                          1012.13
Name: 15, dtype: object
name                    Shad Petersen
email       orci.consectetuer@aol.net
address              134-4184 Leo Av.
country                        Mexico
region                          Xīběi
currency                       $63.02
amount                        1063.02
Name: 16, dtype: object
name                 Calista Dickerson
email       posuere.at.velit@yahoo.com
address          Ap 697-8084 Enim. Rd.
country                          Italy
region                 Haute-Normandie
currency                        $45.48
amount                         1045.48
Name: 17, dtype: object
name                      Cairo Herman
email        nulla.tincidunt@google.ca
address     P.O. Box 959, 7154 Id, St.
country                    Netherlands
region                    North Island
currency                        $24.05
amount                         1024.05
Name: 18, dtype: object
name                          Sierra Suarez
email       ultricies.adipiscing@yahoo.couk
address          P.O. Box 749, 7060 Cum Av.
country                            Pakistan
region                           Mpumalanga
currency                             $18.43
amount                              1018.43
Name: 19, dtype: object
name               Nash Herring
email       quisque@outlook.edu
address       991-5819 Ante Rd.
country                   Chile
region          South Australia
currency                 $26.40
amount                   1026.4
Name: 20, dtype: object
name                     Ingrid Doyle
email       phasellus.at@outlook.couk
address             192 Magna. Avenue
country            Russian Federation
region               Poitou-Charentes
currency                        $2.89
amount                        1002.89
Name: 21, dtype: object
name                  Kim Brock
email        non.dapibus@aol.ca
address     654-8001 Semper Ave
country               Indonesia
region           Cagayan Valley
currency                 $22.15
amount                  1022.15
Name: 22, dtype: object
name               Harlan Baker
email        sit@protonmail.org
address     6090 Vulputate, St.
country                  France
region                Antwerpen
currency                  $2.17
amount                  1002.17
Name: 23, dtype: object
name                           Lester Olsen
email       dolor.quam.elementum@icloud.net
address                    968-2002 Sed Ave
country                             Ireland
region                 Comunitat Valenciana
currency                             $95.04
amount                              1095.04
Name: 24, dtype: object
name             Jeanette Duran
email       orci.sem@icloud.com
address         9805 Mollis St.
country               Australia
region                Magdalena
currency                 $75.51
amount                  1075.51
Name: 25, dtype: object
name                          Tobias Key
email       in.faucibus.orci@icloud.couk
address       P.O. Box 256, 8876 Sed Ave
country                           Sweden
region                   New South Wales
currency                           $0.48
amount                           1000.48
Name: 26, dtype: object
name                     George Avila
email       et.rutrum@protonmail.couk
address         Ap 284-5000 Orci. Ave
country                   South Korea
region                 Kherson oblast
currency                       $25.91
amount                        1025.91
Name: 27, dtype: object
name                        Alvin Vaughan
email       class.aptent.taciti@yahoo.org
address           384-5221 Quisque Street
country                            Poland
region                              Aisén
currency                            $5.55
amount                            1005.55
Name: 28, dtype: object
name               Justin Bright
email          pede.nec@yahoo.ca
address     334-4843 Magna. Road
country                   Mexico
region                     Sucre
currency                  $17.03
amount                   1017.03
Name: 29, dtype: object

In [122]:
for index, rows in dataframe.iterrows():
    print(rows)

name                  Chadwick Nguyen
email       nec.ligula@protonmail.edu
address             Ap 466-2636 A Rd.
country                       Germany
region                          Texas
currency                       $44.16
amount                        1044.16
Name: 0, dtype: object
name                     India Newman
email       vel.venenatis@icloud.couk
address               2125 Sed Street
country                         China
region                     Henegouwen
currency                       $92.54
amount                        1092.54
Name: 1, dtype: object
name                     Deborah Chase
email       lectus.ante@protonmail.org
address             Ap 601-6030 Eu Av.
country                    New Zealand
region                         łódzkie
currency                         $1.88
amount                         1001.88
Name: 2, dtype: object
name                 Donna Salazar
email            mauris@google.org
address     781-6803 Curabitur St.
country                  Indonesia
region                      Madrid
currency                     $2.68
amount                     1002.68
Name: 3, dtype: object
name                        Heidi Bennett
email       ultrices.a.auctor@hotmail.net
address              326-6406 Natoque Ave
country                            Norway
region                   South Gyeongsang
currency                           $32.80
amount                             1032.8
Name: 4, dtype: object
name                      Hyacinth Bauer
email       urna.suscipit@protonmail.com
address                601-916 Ante, Rd.
country               Russian Federation
region                             Cusco
currency                          $28.43
amount                           1028.43
Name: 5, dtype: object
name              Forrest Sweeney
email       commodo.ipsum@aol.edu
address            5500 Ut Avenue
country                    Canada
region            Novgorod Oblast
currency                   $47.63
amount                    1047.63
Name: 6, dtype: object
name                        Kirestin Kramer
email       aliquet.molestie.tellus@aol.edu
address                        1495 Id, Rd.
country                              Poland
region                                Namen
currency                             $82.24
amount                              1082.24
Name: 7, dtype: object
name                       Grant George
email                  felis@google.org
address     508-5183 Suspendisse Avenue
country                       Australia
region             Comunitat Valenciana
currency                         $38.37
amount                          1038.37
Name: 8, dtype: object
name                   Shaeleigh Le
email          quisque@hotmail.couk
address     Ap 600-3443 Dictum. St.
country                     Ireland
region         Västra Götalands län
currency                     $23.51
amount                      1023.51
Name: 9, dtype: object
name                   Scarlett Hester
email       dui.suspendisse@google.org
address           824-2407 Nisi Street
country                           Peru
region                   Moscow Oblast
currency                        $74.46
amount                         1074.46
Name: 10, dtype: object
name                              Fritz Meyers
email       lectus.nullam.suscipit@outlook.edu
address           P.O. Box 502, 7825 A, Avenue
country                            New Zealand
region                      Nord-Pas-de-Calais
currency                                $91.20
amount                                  1091.2
Name: 11, dtype: object
name                              Amanda Myers
email       consectetuer.adipiscing@google.net
address           P.O. Box 764, 2041 Etiam St.
country                                  Italy
region                                Rogaland
currency                                 $4.34
amount                                 1004.34
Name: 12, dtype: object
name           Hedda Prince
email           sem@aol.net
address         126 Sit Rd.
country                Peru
region      Møre og Romsdal
currency             $78.58
amount              1078.58
Name: 13, dtype: object
name                 Madonna Garner
email       orci.donec@outlook.couk
address        Ap 932-2288 Nunc Rd.
country                       Italy
region                      Antalya
currency                     $17.44
amount                      1017.44
Name: 14, dtype: object
name                       Tanek Larson
email       a.mi.fringilla@hotmail.couk
address              369-9250 Et Street
country                         Germany
region                  Oost-Vlaanderen
currency                         $12.13
amount                          1012.13
Name: 15, dtype: object
name                    Shad Petersen
email       orci.consectetuer@aol.net
address              134-4184 Leo Av.
country                        Mexico
region                          Xīběi
currency                       $63.02
amount                        1063.02
Name: 16, dtype: object
name                 Calista Dickerson
email       posuere.at.velit@yahoo.com
address          Ap 697-8084 Enim. Rd.
country                          Italy
region                 Haute-Normandie
currency                        $45.48
amount                         1045.48
Name: 17, dtype: object
name                      Cairo Herman
email        nulla.tincidunt@google.ca
address     P.O. Box 959, 7154 Id, St.
country                    Netherlands
region                    North Island
currency                        $24.05
amount                         1024.05
Name: 18, dtype: object
name                          Sierra Suarez
email       ultricies.adipiscing@yahoo.couk
address          P.O. Box 749, 7060 Cum Av.
country                            Pakistan
region                           Mpumalanga
currency                             $18.43
amount                              1018.43
Name: 19, dtype: object
name               Nash Herring
email       quisque@outlook.edu
address       991-5819 Ante Rd.
country                   Chile
region          South Australia
currency                 $26.40
amount                   1026.4
Name: 20, dtype: object
name                     Ingrid Doyle
email       phasellus.at@outlook.couk
address             192 Magna. Avenue
country            Russian Federation
region               Poitou-Charentes
currency                        $2.89
amount                        1002.89
Name: 21, dtype: object
name                  Kim Brock
email        non.dapibus@aol.ca
address     654-8001 Semper Ave
country               Indonesia
region           Cagayan Valley
currency                 $22.15
amount                  1022.15
Name: 22, dtype: object
name               Harlan Baker
email        sit@protonmail.org
address     6090 Vulputate, St.
country                  France
region                Antwerpen
currency                  $2.17
amount                  1002.17
Name: 23, dtype: object
name                           Lester Olsen
email       dolor.quam.elementum@icloud.net
address                    968-2002 Sed Ave
country                             Ireland
region                 Comunitat Valenciana
currency                             $95.04
amount                              1095.04
Name: 24, dtype: object
name             Jeanette Duran
email       orci.sem@icloud.com
address         9805 Mollis St.
country               Australia
region                Magdalena
currency                 $75.51
amount                  1075.51
Name: 25, dtype: object
name                          Tobias Key
email       in.faucibus.orci@icloud.couk
address       P.O. Box 256, 8876 Sed Ave
country                           Sweden
region                   New South Wales
currency                           $0.48
amount                           1000.48
Name: 26, dtype: object
name                     George Avila
email       et.rutrum@protonmail.couk
address         Ap 284-5000 Orci. Ave
country                   South Korea
region                 Kherson oblast
currency                       $25.91
amount                        1025.91
Name: 27, dtype: object
name                        Alvin Vaughan
email       class.aptent.taciti@yahoo.org
address           384-5221 Quisque Street
country                            Poland
region                              Aisén
currency                            $5.55
amount                            1005.55
Name: 28, dtype: object
name               Justin Bright
email          pede.nec@yahoo.ca
address     334-4843 Magna. Road
country                   Mexico
region                     Sucre
currency                  $17.03
amount                   1017.03
Name: 29, dtype: object

In [123]:
# Utiliser la fonction iloc[index], avec index numero de ligne
dataframe.iloc[10]

name                   Scarlett Hester
email       dui.suspendisse@google.org
address           824-2407 Nisi Street
country                           Peru
region                   Moscow Oblast
currency                        $74.46
amount                         1074.46
Name: 10, dtype: object

In [124]:
# Utiliser la fonction loc[index], avec index numero de ligne
dataframe.loc[0]

name                  Chadwick Nguyen
email       nec.ligula@protonmail.edu
address             Ap 466-2636 A Rd.
country                       Germany
region                          Texas
currency                       $44.16
amount                        1044.16
Name: 0, dtype: object

In [125]:
# Afficher le nom de la premier ligne
dataframe.iloc[10]['name']

'Scarlett Hester'

In [126]:
# Afficher le amount de la premier ligne
dataframe.iloc[10]['amount']

1074.46

In [127]:
# Afficher le email de la premier ligne
dataframe.iloc[10]['email']

'dui.suspendisse@google.org'

In [128]:
dataframe.shape

(30, 7)

In [132]:
# Ajouter une colonne devise

dataframe['devise'] = 'USD'

In [133]:
dataframe.head()

,name,email,address,country,region,currency,amount,devise
0,Chadwick Nguyen,nec.ligula@protonmail.edu,Ap 466-2636 A Rd.,Germany,Texas,$44.16,1044.16,USD
1,India Newman,vel.venenatis@icloud.couk,2125 Sed Street,China,Henegouwen,$92.54,1092.54,USD
2,Deborah Chase,lectus.ante@protonmail.org,Ap 601-6030 Eu Av.,New Zealand,łódzkie,$1.88,1001.88,USD
3,Donna Salazar,mauris@google.org,781-6803 Curabitur St.,Indonesia,Madrid,$2.68,1002.68,USD
4,Heidi Bennett,ultrices.a.auctor@hotmail.net,326-6406 Natoque Ave,Norway,South Gyeongsang,$32.80,1032.80,USD

In [134]:
dataframe['USD'] = dataframe['amount']

In [135]:
dataframe.head()

,name,email,address,country,region,currency,amount,devise,USD
0,Chadwick Nguyen,nec.ligula@protonmail.edu,Ap 466-2636 A Rd.,Germany,Texas,$44.16,1044.16,USD,1044.16
1,India Newman,vel.venenatis@icloud.couk,2125 Sed Street,China,Henegouwen,$92.54,1092.54,USD,1092.54
2,Deborah Chase,lectus.ante@protonmail.org,Ap 601-6030 Eu Av.,New Zealand,łódzkie,$1.88,1001.88,USD,1001.88
3,Donna Salazar,mauris@google.org,781-6803 Curabitur St.,Indonesia,Madrid,$2.68,1002.68,USD,1002.68
4,Heidi Bennett,ultrices.a.auctor@hotmail.net,326-6406 Natoque Ave,Norway,South Gyeongsang,$32.80,1032.80,USD,1032.80

In [136]:
del dataframe['devise']

In [149]:
dataframe['XOF'] = 0

In [150]:
dataframe['EUR'] = 0

In [151]:
# taux de change de USD -> XOF = 610.17

In [152]:
dataframe.head()

,name,email,address,country,region,currency,amount,USD,XOF,EUR
0,Chadwick Nguyen,nec.ligula@protonmail.edu,Ap 466-2636 A Rd.,Germany,Texas,$44.16,1044.16,1044.16,0,0
1,India Newman,vel.venenatis@icloud.couk,2125 Sed Street,China,Henegouwen,$92.54,1092.54,1092.54,0,0
2,Deborah Chase,lectus.ante@protonmail.org,Ap 601-6030 Eu Av.,New Zealand,łódzkie,$1.88,1001.88,1001.88,0,0
3,Donna Salazar,mauris@google.org,781-6803 Curabitur St.,Indonesia,Madrid,$2.68,1002.68,1002.68,0,0
4,Heidi Bennett,ultrices.a.auctor@hotmail.net,326-6406 Natoque Ave,Norway,South Gyeongsang,$32.80,1032.80,1032.80,0,0

In [153]:
# Function to convert USD in XOF

def convert_to_xof(x):
    return x * 610.17

dataframe['XOF'] = dataframe['amount'].apply(convert_to_xof)

In [144]:
dataframe['XOF']

0     637115.1072
1     666635.1318
2     611317.1196
3     611805.2556
4     630183.5760
5     627517.1331
6     639232.3971
7     660350.3808
8     633582.2229
9     624515.0967
10    655603.2582
11    665817.5040
12    612818.1378
13    658117.1586
14    620811.3648
15    617571.3621
16    648622.9134
17    637920.5316
18    624844.5885
19    621415.4331
20    626278.4880
21    611933.3913
22    623685.2655
23    611494.0689
24    668160.5568
25    656243.9367
26    610462.8816
27    625979.5047
28    613556.4435
29    620561.1951
Name: XOF, dtype: float64

In [154]:
# taux de change de EUR -> XOF = 655.957
# 1 EUR -> 655.957 XOF
#    ?  -> XXXXXX XOF
# MONTANT / 655.957

def convert_to_eur(x):
    return x / 655.957


dataframe['EUR'] = dataframe['XOF'].apply(convert_to_eur)

In [146]:
dataframe['EUR']

0      971.275720
1     1016.278707
2      931.946941
3      932.691100
4      960.708668
5      956.643702
6      974.503507
7     1006.697666
8      965.889872
9      952.067127
10     999.460724
11    1015.032241
12     934.235229
13    1003.293141
14     946.420825
15     941.481472
16     988.819257
17     972.503581
18     952.569434
19     947.341721
20     954.755400
21     932.886441
22     950.802058
23     932.216699
24    1018.604202
25    1000.437432
26     930.644664
27     954.299603
28     935.360768
29     946.039443
Name: EUR, dtype: float64

In [155]:
def add_currency_eur_symbol(x):
    return f'{x} EUR'


dataframe['EUR'] = dataframe['EUR'].apply(add_currency_eur_symbol)

In [156]:
dataframe['EUR']

0      971.2757195974735 EUR
1     1016.2787069884154 EUR
2      931.9469410342446 EUR
3      932.6910995690265 EUR
4      960.7086684035689 EUR
5      956.6437024073224 EUR
6      974.5035072420907 EUR
7      1006.697665853097 EUR
8      965.8898722019887 EUR
9      952.0671274184131 EUR
10     999.4607241023419 EUR
11    1015.0322414426555 EUR
12     934.2352285286994 EUR
13    1003.2931405564693 EUR
14     946.4208245357546 EUR
15      941.481472261139 EUR
16     988.8192570549594 EUR
17     972.5035811798639 EUR
18     952.5694344293909 EUR
19     947.3417207225473 EUR
20     954.7554001253131 EUR
21     932.8864411844067 EUR
22     950.8020579092837 EUR
23     932.2166985031031 EUR
24     1018.604202409609 EUR
25    1000.4374321792434 EUR
26      930.644663598376 EUR
27     954.2996030227592 EUR
28      935.360768312557 EUR
29     946.0394432866786 EUR
Name: EUR, dtype: object